import { FC } from 'react'
import styles from './AdminHome.module.scss'

const AdminHome: FC = () => {
  return (
    <div className={styles['admin-home']}>
      <h1 className={styles.title}>Шановний адміністратор!</h1>
      <div className={styles.info}>
        <p>
          Ласкаво просимо на панель керування вашим кіно-сайтом. Тут ви можете
          ефективно керувати всіма аспектами вашого веб-ресурсу, включаючи
          додавання нових фільмів, редагування існуючих записів, та багато
          іншого.
        </p>

        <h2>Основні можливості панелі адміністратора:</h2>
        <ul>
          <li>
            <strong>Додавання нових фільмів:</strong>
            <ul>
              <li>Завантажте постери, трейлери та інші матеріали.</li>
              <li>Вкажіть назву, рік випуску, тривалість, країну-виробника.</li>
              <li>Додайте жанр і акторів.</li>
            </ul>
          </li>
          <li>
            <strong>Додавання нових акторів та нових жанрів</strong>
          </li>
          <li>
            <strong>Редагування існуючих фільмів:</strong>
            <ul>
              <li>Оновлюйте інформацію про фільми за потреби.</li>
              <li>Додавайте нові трейлери або змінюйте постери.</li>
            </ul>
          </li>
          <li>
            <strong>Статистика та аналітика:</strong>
            <ul>
              <li>Переглядайте статистику переглядів фільмів.</li>
              <li>Аналізуйте популярність різних фільмів.</li>
            </ul>
          </li>
          <li>
            <strong>Користувачі:</strong>
            <ul>
              <li>Керуйте обліковими записами користувачів.</li>
              <li>Додавайте нових адміністраторів.</li>
            </ul>
          </li>
        </ul>

        <p>
          Ваш внесок у підтримку та розвиток сайту надзвичайно важливий. Завдяки
          вашим зусиллям наші користувачі можуть насолоджуватися переглядом
          улюблених фільмів та відкривати для себе нові кіношедеври.
        </p>

        <p>Бажаємо вам успіху в адмініструванні сайту!</p>
      </div>
    </div>
  )
}

export default AdminHome
